       IDENTIFICATION DIVISION.
       PROGRAM-ID.                HELLO.
       AUTHOR.                    MARCUS SACRAMENTO.
       INSTALLATION.              EXEMPLO.
       DATE-WRITTEN.              28/04/2019.
       DATE-COMPILED.             28/04/2019.
       SECURITY.                  CONFIDENTIAL.
      ****** Programa de exemplo para compilação e execução ******

       ENVIRONMENT DIVISION.

       DATA DIVISION.

       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD'
           STOP RUN.