//HERC010A JOB (COBOL),
//             'COMPILACION COBOL',
//             CLASS=A,
//             MSGCLASS=H,
//             REGION=8M,TIME=1440,
//             MSGLEVEL=(1,1)
//COMPILA  EXEC COBOL,
//         PROG='PGM00001',
//         BIBF='HERC01.PRIVLIB.SOURCE',
//         BIBC='HERC01.PRIVLIB.LOAD'
/*
//
