//DSJCLLIB JOB (123),'CURSO',CLASS=A,MSGCLASS=A,MSGLEVEL=(1,1),
//             NOTIFY=&SYSUID
//NAME1    JCLLIB ORDER=MARCUS.CURSO.PROCLIB
//*
//*********************************************************************
//* DOC: CHAMADA A UMA CATALOG PROCEDURE
//*********************************************************************
//STEP02   EXEC PROC=CATLPROC
2